app/views/albums/show.html.erb

SELECT "pictures".* FROM "pictures" WHERE "pictures"."album_id" = 2 ORDER BY picture_attachment_file_name ASC
---
  <table>
      <% @album.pictures.each do |picture| %>