app/controllers/albums_controller.rb

  def index
    @albums = Album.all
---
SELECT "albums".* FROM "albums"

  def edit
    @album = Album.find(params[:id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @album = Album.new(params[:album])
    if !current_user.admin?
        @album.user_id = current_user.id
    end
    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("created_at", "text_body", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 11 Nov 2012 06:55:17 UTC +00:00], ["text_body", "hallotestalbum"], ["title", "testalbum"], ["updated_at", Sun, 11 Nov 2012 06:55:17 UTC +00:00], ["user_id", nil]]

  def destroy
    @album = Album.find(params[:id])
    @album.destroy
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 1]]