app/controllers/pictures_controller.rb

  def show
    @picture = Picture.find(params[:id])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @picture = Picture.new
    @redirect_back_to_album_id = nil
    if(params.has_key? :album_id)
      @album = Album.find(params[:album_id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @picture = Picture.find(params[:id])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "4"]]

  def create
    @picture = Picture.new(params[:picture])
    @picture = Picture.create(params[:picture])

    saving_successful = @picture.save
    respond_to do |format|
      if saving_successful
	if params.has_key? :redirect
	  @album = Album.find(params[:redirect])
---
INSERT INTO "pictures" ("album_id", "created_at", "picture_attachment_content_type", "picture_attachment_file_name", "picture_attachment_file_size", "picture_attachment_updated_at", "text_body", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @picture = Picture.find(params[:id])


    respond_to do |format|
      if @picture.update_attributes(params[:picture])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "pictures" SET "album_id" = 1, "updated_at" = '2012-11-17 08:30:06.123931' WHERE "pictures"."id" = 11

  def destroy
    @picture = Picture.find(params[:id])
    @picture.destroy
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 1]]

  def import_from_folder
    @files = []
    unless params.has_key? :album_id
	redirect_to albums_url, notice: "Bitte ein Album auswaehlen!"
	return
    end
    @album = Album.find params[:album_id]
     unless @album
	redirect_to albums_url, notice: "Album existiert nicht!"
	return
    end

    base_path_for_import = "c:/temp/picture_import"

    @files.concat Dir.glob(base_path_for_import + "/*.jpg")
    @files.concat Dir.glob(base_path_for_import + "/*.JPG")
    @files = @files.uniq

    if not File.exists?(base_path_for_import + "/processed")
      Dir.mkdir(base_path_for_import + "/processed")
    end

    @target_path = []
    @files.each do |file|
      new_picture = Picture.new
      new_picture.album_id =@album.id
      attachment_file = File.new(file)
      new_picture.picture_attachment = attachment_file
      new_picture.save
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "pictures" ("album_id", "created_at", "picture_attachment_content_type", "picture_attachment_file_name", "picture_attachment_file_size", "picture_attachment_updated_at", "text_body", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)